1.	Найти все телефоны, цена которых больше 900.
2.	Найти все телефоны с ценой между 700 и 1000.
3.	Найти все телефоны, выпущенные в 2023 году.
4.	Найти все телефоны брендов Apple и Samsung.
5.	Найти все телефоны, у которых доступен цвет "Black".
6.	Найти телефоны с памятью 512GB и ценой меньше 1000.
7.	Найти телефоны, у которых нет цвета "White".
8.	Отсортировать телефоны по цене в порядке убывания.
9.	Отсортировать телефоны по количеству (убывание), вывести первые 2 документа.
10.	Вывести первые 3 телефона из коллекции.
11.	Пропустить первые 5 телефонов и вывести следующие 3.
12.	Вывести первые два доступных цвета для каждого телефона.
13.	Вывести последние два доступных варианта памяти для каждого телефона.
14.	Увеличить цену всех телефонов Apple на 100.
15.	Добавить новый цвет "Gold" для всех телефонов Samsung.
16.	Установить количество телефонов "Google Pixel 8" равным 25.
17.	Удалить поле releaseYear для всех телефонов Sony.
18.	Добавить новые варианты памяти "2TB" и "3TB" для телефонов Xiaomi.
19.	Удалить последний элемент из массива colors у телефона "Asus ROG Phone 7".
20.	Удалить вариант памяти "128GB" у телефонов Huawei.
21.	Увеличить количество всех телефонов на складе на 10.
22.	Удалить все цвета "Black" и "White" из телефонов Realme.
23.	Удалить все телефоны с ценой меньше 700.
24.	Удалить телефон "Motorola Edge 40 Pro".
25.	Удалить все телефоны бренда Realme.
